/**************************************************************************/
/*                         This file is part of:                          */
/*                             GODOT ENGINE                               */
/*                        https://godotengine.org                         */
/**************************************************************************/

#pragma once

#include "test_macros.h"

#include <cstring>
#include <cstddef>

#include "core/config/project_settings.h"
#include "core/variant/variant.h"
#include "../core/effective_config_snapshot.h"
#include "../core/gaussian_data.h"
#include "../core/gaussian_splat_scene_director.h"
#include "../core/gaussian_splat_manager.h"
#include "../core/gaussian_splat_world.h"
#include "../core/gaussian_streaming.h"
#include "../core/gs_project_settings.h"
#include "../nodes/gaussian_splat_world_3d.h"
#include "../renderer/gaussian_gpu_layout.h"
#include "../renderer/gpu_sorting_config.h"
#include "../renderer/gaussian_splat_renderer.h"
#include "../renderer/quantization_config.h"
#include "../renderer/pipeline_feature_set.h"
#include "../renderer/render_debug_state_orchestrator.h"
#include "../renderer/render_instancing_orchestrator.h"
#include "../renderer/render_pipeline_stages.h"
#include "../interfaces/gpu_sorting_pipeline.h"
#include "../interfaces/output_compositor.h"
#include "servers/rendering/rendering_device.h"
#include "servers/rendering_server.h"
#include "servers/rendering/renderer_rd/storage_rd/texture_storage.h"
#include "servers/rendering/renderer_rd/storage_rd/render_data_rd.h"
#include "servers/rendering/renderer_rd/storage_rd/render_scene_data_rd.h"
#include "servers/rendering/storage/render_scene_buffers.h"
#include "scene/main/scene_tree.h"
#include "scene/main/window.h"

namespace TestGaussianSplatting {

static_assert(GS_RENDER_PARAMS_LAYOUT_VERSION == 19, "Render params layout version mismatch");

static_assert(sizeof(InstanceDataGPU) == 112, "InstanceDataGPU size contract changed");
static_assert(offsetof(InstanceDataGPU, lod) == 72, "InstanceDataGPU.lod offset contract changed");
static_assert(offsetof(InstanceDataGPU, wind_params) == 80, "InstanceDataGPU.wind_params offset contract changed");
static_assert(offsetof(InstanceDataGPU, effect_params) == 96, "InstanceDataGPU.effect_params offset contract changed");
static_assert(sizeof(AssetMetaGPU) == 112, "AssetMetaGPU size contract changed");
static_assert(offsetof(AssetMetaGPU, lod_ranges) == 48, "AssetMetaGPU.lod_ranges offset contract changed");
static_assert(sizeof(ChunkMetaGPU) == 64, "ChunkMetaGPU size contract changed");
static_assert(offsetof(ChunkMetaGPU, sh_limit) == 44, "ChunkMetaGPU.sh_limit offset contract changed");
static_assert(sizeof(SplatRefGPU) == 8, "SplatRefGPU size contract changed");
static_assert(sizeof(PackedGaussian) == 144, "PackedGaussian size contract changed");
static_assert(offsetof(PackedGaussian, rotation) == 32, "PackedGaussian.rotation offset contract changed");
static_assert(offsetof(PackedGaussian, sh) == 48, "PackedGaussian.sh offset contract changed");
static_assert(offsetof(PackedGaussian, sh_metadata) == 140, "PackedGaussian.sh_metadata offset contract changed");
static_assert(sizeof(PackedGaussianF16) == 144, "PackedGaussianF16 size contract changed");
static_assert(sizeof(PackedGaussianQuantized) == 80, "PackedGaussianQuantized size contract changed");
static_assert(sizeof(TileRenderParamsGPU) == 912, "TileRenderParamsGPU size contract changed");
static_assert(offsetof(TileRenderParamsGPU, viewport_size) == 256, "TileRenderParamsGPU.viewport_size offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, camera_position) == 320, "TileRenderParamsGPU.camera_position offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, lighting_mode) == 560, "TileRenderParamsGPU.lighting_mode offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, instance_rotation_inv_col2) == 640, "TileRenderParamsGPU.instance_rotation_inv_col2 offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, wind_dir_strength) == 656, "TileRenderParamsGPU.wind_dir_strength offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, wind_time_config) == 672, "TileRenderParamsGPU.wind_time_config offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, effector_meta) == 688, "TileRenderParamsGPU.effector_meta offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, effector_spheres) == 704, "TileRenderParamsGPU.effector_spheres offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, effector_configs) == 768, "TileRenderParamsGPU.effector_configs offset contract changed");
static_assert(offsetof(TileRenderParamsGPU, effector_opacity_configs) == 832, "TileRenderParamsGPU.effector_opacity_configs offset contract changed");

TEST_CASE("[GaussianSplatting] Stage cascade contract preserves first failure and downstream skip cause") {
	GaussianSplatRenderer::StageResult sort_failure;
	sort_failure.status = GaussianSplatRenderer::StageResult::StageStatus::FAILED;
	sort_failure.is_error = true;
	sort_failure.reason = "Sort failed: test injection";
	RenderPipelineStages::stamp_stage_result_contract(sort_failure, "sort",
			RenderRouteUID::COMMON_FAIL_SORT_FAILED,
			GaussianSplatRenderer::IndexDomain::CHUNK_REF,
			GaussianSplatRenderer::IndexDomain::UNKNOWN, 8, 0);

	GaussianSplatRenderer::StageResult raster_skip =
			RenderPipelineStages::make_downstream_skip_result("raster", sort_failure,
					"Raster skipped: sort blocked raster",
					GaussianSplatRenderer::RenderFallbackReason::NONE);
	RenderPipelineStages::stamp_stage_result_contract(raster_skip, "raster",
